# Вариант 2
# Дано целое число N (32 < N < 126). Вывести символ с кодом, равным N.
N = int(input('Введите целое число в диапазоне от 33 до 125: '))

print(f'Введённое число соответствует символу "{chr(N)}"')
